tap "homebrew/bundle"
tap "homebrew/services"
tap "nahive/spotify-notify"

# Packages
brew "bash"
brew "git"
brew "tmux"
brew "watch"
brew "rbenv"
brew "nvm"
brew "cowsay"
brew "fortune"
brew "yarn"
brew "fzf"
brew "vim"
brew "eza"
brew "bat"
brew "pure"

# brew "postgresql"
# brew "pyenv"
# brew "stern"
# brew "awscli"
# brew "kubernetes-cli"

# Apps
cask "visual-studio-code"
cask "iterm2"
cask "1password"
cask "1password-cli"
cask "aerial"
cask "firefox"
cask "spotify"
cask "slack"
cask "obsidian"
cask "vlc"
cask "whatsapp"
cask "raycast"
cask "ente-auth"
cask "flux"
cask "openmtp"
cask "appcleaner"
cask "maccy"
cask "docker"
cask "bruno"
cask "font-hack"
cask "hiddenbar"

# IDE plugins
vscode "compulim.vscode-clock"
vscode "eamodio.gitlens"
vscode "fbosch.battery-indicator"
vscode "bierner.markdown-mermaid"
vscode "42crunch.vscode-openapi"
vscode "ms-vscode.atom-keybindings"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "vayan.haml"
vscode "yzhang.markdown-all-in-one"
vscode "enkia.tokyo-night"
vscode "robbowen.synthwave-vscode"

# Mac apps
mas "Menu Bar Calendar", id: 1558360383
